content-org/all-posts.org
#+hugo_base_dir: ../
#+hugo_section:


*** DONE Alphabet Superset
:PROPERTIES:
:EXPORT_FILE_NAME: _index
:EXPORT_HUGO_CUSTOM_FRONT_MATTER: :featured_image /img/featured_alphabet-superset.jpg 
:END:


Alphabet Superset is (or maybe rather was) a creative challenge conceived by Campbell Walker aka Struthless. The idea is to create 26 pieces of art, one every week, with a topic for each one starting with one letter of the alphabet, going from A to Z. The overarching theme and the style of the entire set is defined in the beginning, so that they will create a cohesive whole.

Originally, the challenge ran from September 2023 to April 2024. I found out about it almost exactly a year later, so that's when I am doing mine; starting on September 2nd 2024, and hopefully finishing on April 7th 2025.

So here it comes! And my topic is:

**** Myths, legends & fairy tales


